notes/lisp.html
<!DOCTYPE html>
<html>
<head>
<title>Lisp DNA</title>
<!-- 2015-03-09 Mon 16:54 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="md11235">
</head>
<body>
<div id="content">
<h1 class="title">Lisp DNA</h1>
<p>
If we ask ourselves, ‘What is the genotype of Lisp?’, what is its DNA, its genetic legacy, I'd suggest that it is composed of the following five ideas.
</p>

<ol class="org-ol">
<li>Recursion as the primary mean of expressing procedure calling.
</li>
<li>Heterogenous lists as the way of composing and dissecting complex data.
</li>
<li>Programming by defining functions.
</li>
<li>Garbage collection.
</li>
<li>Programs as data.
</li>
</ol>
</div>
<div id="postamble" class="status">
<div class="navfoot">
     <hr>
     <table summary="Footer navigation" border="0" width="100%">
       <col width="33%"><col width="34%"><col width="33%">
       <tbody><tr>
         <td align="left">
           <span class="footdate">Last Updated:Mon Mar  9 16:54:21 2015</span>
         </td>
         <td align="center">
           <span class="foothome">
             <a href="/index.html">Home</a>
           </span>
         </td>
         <td align="right">
    		<a href="mailto:md11235 at gmail dot com">Contact Me</a>
         </td>
       </tr>
     </tbody></table>
    </div>
</div>
</body>
</html>